app/views/users/_form.html.erb

SELECT "roles".* FROM "roles"
---
      <%= f.label :role %>
      <%= collection_select(:user, :role_id, Role.all, :id, :description) %>