app/views/rooms/index.json.jbuilder

SELECT "measures".* FROM "measures" WHERE "measures"."room_id" = ?  [["room_id", 1]]
---
  json.measures do
      json.array!(room.measures.take(1)) do |measure|