app/views/rooms/show.html.erb

  <tbody>
    <% @room.measures.order('created_at DESC').take(10).each do |measure| %>
---
SELECT  "measures".* FROM "measures" WHERE "measures"."room_id" = ?  ORDER BY created_at DESC LIMIT 10  [["room_id", 1]]