app/controllers/measures_controller.rb

    def set_room
      @room = Room.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]