app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    @room.user = @user
    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Rasfas"], ["user_id", 1], ["created_at", "2016-02-22 14:21:36.876612"], ["updated_at", "2016-02-22 14:21:36.876612"]]